package aom.mob.player;

public class Player {

    public String generateIntroductoryStory() { // TODO
        return "Вы - обычный технический ассистент на научно-исследовательской станции \"Исход\". Эта смена была и остается необычной для вас. Вами было пережито много проишествий всего за несколько часов. Сидя в одиночестве на мягком кресле в инженерном отделе, вы слышите очередное объявление о новой проблеме. Холодный, женский, синтезированный голос доносит до ваших ушей, что на станции обнаружена неизвестная форма жизни. В объявлении также говорится, что вам стоит оставаться в своем отсеке, а в случае обнаружения неизвестных существ доложить об этом службе безопасности. Осознавая, что вы давно не видели никаких сотрудников службы безопасности, как и, в прочем, членов экипажа, вы решаете проигнорировать эту рекомендацию. Несмотря на слова руководства на протяжении всей смены о том, что в скором времени ситуация взята в руки, вы больше не можете терпеть и ждать помощи. Переполняющие вас чувства страха и одиночества заставляют начать вас искать спасение самому - вы хотите сбежать, не дожидаясь помощи!\n\nВаша задача - выжить, а самый надежный, на ваш взгляд, способ - сбежать с этой станции. Ожидание помощи даже более рискованно, чем спасение самому. Попытайтесь найти способ сбежать. Удачи!";
    }

}
